export interface LocationItem { name: string; code: string; fullName?: string; }

export const REGIONS: LocationItem[] = [
  {
    "name": "서울",
    "fullName": "서울특별시",
    "code": "1100000000"
  },
  {
    "name": "경기",
    "fullName": "경기도",
    "code": "4100000000"
  },
  {
    "name": "부산",
    "fullName": "부산광역시",
    "code": "2600000000"
  },
  {
    "name": "인천",
    "fullName": "인천광역시",
    "code": "2800000000"
  },
  {
    "name": "광주",
    "fullName": "광주광역시",
    "code": "2900000000"
  },
  {
    "name": "대전",
    "fullName": "대전광역시",
    "code": "3000000000"
  },
  {
    "name": "대구",
    "fullName": "대구광역시",
    "code": "2700000000"
  },
  {
    "name": "울산",
    "fullName": "울산광역시",
    "code": "3100000000"
  },
  {
    "name": "강원",
    "fullName": "강원도",
    "code": "4200000000"
  },
  {
    "name": "충북",
    "fullName": "충청북도",
    "code": "4300000000"
  },
  {
    "name": "충남",
    "fullName": "충청남도",
    "code": "4400000000"
  },
  {
    "name": "전북",
    "fullName": "전라북도",
    "code": "4500000000"
  },
  {
    "name": "전남",
    "fullName": "전라남도",
    "code": "4600000000"
  },
  {
    "name": "경북",
    "fullName": "경상북도",
    "code": "4700000000"
  },
  {
    "name": "경남",
    "fullName": "경상남도",
    "code": "4800000000"
  },
  {
    "name": "제주",
    "fullName": "제주특별자치도",
    "code": "5000000000"
  },
  {
    "name": "세종",
    "fullName": "세종특별자치시",
    "code": "3600000000"
  }
];

export const DISTRICTS: Record<string, LocationItem[]> = {
  "1100000000": [
    {
      "name": "종로구",
      "code": "1111000000"
    },
    {
      "name": "중구",
      "code": "1114000000"
    },
    {
      "name": "용산구",
      "code": "1117000000"
    },
    {
      "name": "성동구",
      "code": "1120000000"
    },
    {
      "name": "광진구",
      "code": "1121500000"
    },
    {
      "name": "동대문구",
      "code": "1123000000"
    },
    {
      "name": "중랑구",
      "code": "1126000000"
    },
    {
      "name": "성북구",
      "code": "1129000000"
    },
    {
      "name": "강북구",
      "code": "1130500000"
    },
    {
      "name": "도봉구",
      "code": "1132000000"
    },
    {
      "name": "노원구",
      "code": "1135000000"
    },
    {
      "name": "은평구",
      "code": "1138000000"
    },
    {
      "name": "서대문구",
      "code": "1141000000"
    },
    {
      "name": "마포구",
      "code": "1144000000"
    },
    {
      "name": "양천구",
      "code": "1147000000"
    },
    {
      "name": "강서구",
      "code": "1150000000"
    },
    {
      "name": "구로구",
      "code": "1153000000"
    },
    {
      "name": "금천구",
      "code": "1154500000"
    },
    {
      "name": "영등포구",
      "code": "1156000000"
    },
    {
      "name": "동작구",
      "code": "1159000000"
    },
    {
      "name": "관악구",
      "code": "1162000000"
    },
    {
      "name": "서초구",
      "code": "1165000000"
    },
    {
      "name": "강남구",
      "code": "1168000000"
    },
    {
      "name": "송파구",
      "code": "1171000000"
    },
    {
      "name": "강동구",
      "code": "1174000000"
    }
  ],
  "2600000000": [
    {
      "name": "중구",
      "code": "2611000000"
    },
    {
      "name": "서구",
      "code": "2614000000"
    },
    {
      "name": "동구",
      "code": "2617000000"
    },
    {
      "name": "영도구",
      "code": "2620000000"
    },
    {
      "name": "부산진구",
      "code": "2623000000"
    },
    {
      "name": "동래구",
      "code": "2626000000"
    },
    {
      "name": "남구",
      "code": "2629000000"
    },
    {
      "name": "북구",
      "code": "2632000000"
    },
    {
      "name": "해운대구",
      "code": "2635000000"
    },
    {
      "name": "사하구",
      "code": "2638000000"
    },
    {
      "name": "금정구",
      "code": "2641000000"
    },
    {
      "name": "강서구",
      "code": "2644000000"
    },
    {
      "name": "연제구",
      "code": "2647000000"
    },
    {
      "name": "수영구",
      "code": "2650000000"
    },
    {
      "name": "사상구",
      "code": "2653000000"
    },
    {
      "name": "기장군",
      "code": "2671000000"
    }
  ],
  "2700000000": [
    {
      "name": "중구",
      "code": "2711000000"
    },
    {
      "name": "동구",
      "code": "2714000000"
    },
    {
      "name": "동구안심출장",
      "code": "2714500000"
    },
    {
      "name": "서구",
      "code": "2717000000"
    },
    {
      "name": "남구",
      "code": "2720000000"
    },
    {
      "name": "북구",
      "code": "2723000000"
    },
    {
      "name": "북구칠곡출장",
      "code": "2723500000"
    },
    {
      "name": "수성구",
      "code": "2726000000"
    },
    {
      "name": "달서구",
      "code": "2729000000"
    },
    {
      "name": "달성군",
      "code": "2771000000"
    },
    {
      "name": "군위군",
      "code": "2772000000"
    }
  ],
  "2800000000": [
    {
      "name": "중구",
      "code": "2811000000"
    },
    {
      "name": "중구영종출장",
      "code": "2811500000"
    },
    {
      "name": "중구용유출장",
      "code": "2811600000"
    },
    {
      "name": "동구",
      "code": "2814000000"
    },
    {
      "name": "남구",
      "code": "2817000000"
    },
    {
      "name": "미추홀구",
      "code": "2817700000"
    },
    {
      "name": "연수구",
      "code": "2818500000"
    },
    {
      "name": "남동구",
      "code": "2820000000"
    },
    {
      "name": "북구",
      "code": "2823000000"
    },
    {
      "name": "북구계양출장",
      "code": "2823500000"
    },
    {
      "name": "부평구",
      "code": "2823700000"
    },
    {
      "name": "계양구",
      "code": "2824500000"
    },
    {
      "name": "서구",
      "code": "2826000000"
    },
    {
      "name": "서구검단출장",
      "code": "2826500000"
    },
    {
      "name": "강화군",
      "code": "2871000000"
    },
    {
      "name": "옹진군",
      "code": "2872000000"
    }
  ],
  "2900000000": [
    {
      "name": "동구",
      "code": "2911000000"
    },
    {
      "name": "서구",
      "code": "2914000000"
    },
    {
      "name": "남구",
      "code": "2915500000"
    },
    {
      "name": "북구",
      "code": "2917000000"
    },
    {
      "name": "광산구",
      "code": "2920000000"
    }
  ],
  "3000000000": [
    {
      "name": "동구",
      "code": "3011000000"
    },
    {
      "name": "중구",
      "code": "3014000000"
    },
    {
      "name": "서구",
      "code": "3017000000"
    },
    {
      "name": "유성구",
      "code": "3020000000"
    },
    {
      "name": "대덕구",
      "code": "3023000000"
    }
  ],
  "3100000000": [
    {
      "name": "중구",
      "code": "3111000000"
    },
    {
      "name": "남구",
      "code": "3114000000"
    },
    {
      "name": "동구",
      "code": "3117000000"
    },
    {
      "name": "북구",
      "code": "3120000000"
    },
    {
      "name": "울주군",
      "code": "3171000000"
    }
  ],
  "3600000000": [
    {
      "name": "세종시",
      "code": "3611000000"
    }
  ],
  "4100000000": [
    {
      "name": "인천시",
      "code": "4101000000"
    },
    {
      "name": "인천시중구",
      "code": "4101100000"
    },
    {
      "name": "인천시동구",
      "code": "4101200000"
    },
    {
      "name": "인천시남구",
      "code": "4101300000"
    },
    {
      "name": "인천시북구",
      "code": "4101400000"
    },
    {
      "name": "부천군",
      "code": "4105000000"
    },
    {
      "name": "수원시",
      "code": "4111000000"
    },
    {
      "name": "수원시장안구",
      "code": "4111100000"
    },
    {
      "name": "수원시권선구",
      "code": "4111300000"
    },
    {
      "name": "수원시팔달구",
      "code": "4111500000"
    },
    {
      "name": "수원시영통구",
      "code": "4111700000"
    },
    {
      "name": "성남시",
      "code": "4113000000"
    },
    {
      "name": "성남시수정구",
      "code": "4113100000"
    },
    {
      "name": "성남시중원구",
      "code": "4113300000"
    },
    {
      "name": "성남시분당구",
      "code": "4113500000"
    },
    {
      "name": "의정부시",
      "code": "4115000000"
    },
    {
      "name": "안양시",
      "code": "4117000000"
    },
    {
      "name": "안양시만안구",
      "code": "4117100000"
    },
    {
      "name": "안양시동안구",
      "code": "4117300000"
    },
    {
      "name": "안양시만안출",
      "code": "4117500000"
    },
    {
      "name": "안양시동안출",
      "code": "4117600000"
    },
    {
      "name": "부천시",
      "code": "4119000000"
    },
    {
      "name": "부천시중구",
      "code": "4119100000"
    },
    {
      "name": "부천시원미구",
      "code": "4119200000"
    },
    {
      "name": "부천시남구",
      "code": "4119300000"
    },
    {
      "name": "부천시소사구",
      "code": "4119400000"
    },
    {
      "name": "부천시원미구",
      "code": "4119500000"
    },
    {
      "name": "부천시오정구",
      "code": "4119600000"
    },
    {
      "name": "부천시소사구",
      "code": "4119700000"
    },
    {
      "name": "부천시오정구",
      "code": "4119900000"
    },
    {
      "name": "광명시",
      "code": "4121000000"
    },
    {
      "name": "평택시",
      "code": "4122000000"
    },
    {
      "name": "송탄시",
      "code": "4123000000"
    },
    {
      "name": "동두천시",
      "code": "4125000000"
    },
    {
      "name": "안산시",
      "code": "4127000000"
    },
    {
      "name": "안산시상록구",
      "code": "4127100000"
    },
    {
      "name": "안산시단원구",
      "code": "4127300000"
    },
    {
      "name": "고양시",
      "code": "4128000000"
    },
    {
      "name": "고양시덕양구",
      "code": "4128100000"
    },
    {
      "name": "고양시일산구",
      "code": "4128300000"
    },
    {
      "name": "고양시일산동구",
      "code": "4128500000"
    },
    {
      "name": "고양시일산서구",
      "code": "4128700000"
    },
    {
      "name": "과천시",
      "code": "4129000000"
    },
    {
      "name": "구리시",
      "code": "4131000000"
    },
    {
      "name": "평택시",
      "code": "4133000000"
    },
    {
      "name": "미금시",
      "code": "4135000000"
    },
    {
      "name": "남양주시",
      "code": "4136000000"
    },
    {
      "name": "오산시",
      "code": "4137000000"
    },
    {
      "name": "시흥시",
      "code": "4139000000"
    },
    {
      "name": "군포시",
      "code": "4141000000"
    },
    {
      "name": "의왕시",
      "code": "4143000000"
    },
    {
      "name": "하남시",
      "code": "4145000000"
    },
    {
      "name": "용인시",
      "code": "4146000000"
    },
    {
      "name": "용인시처인구",
      "code": "4146100000"
    },
    {
      "name": "용인시수지출",
      "code": "4146200000"
    },
    {
      "name": "용인시기흥구",
      "code": "4146300000"
    },
    {
      "name": "용인시수지구",
      "code": "4146500000"
    },
    {
      "name": "파주시",
      "code": "4148000000"
    },
    {
      "name": "이천시",
      "code": "4150000000"
    },
    {
      "name": "안성시",
      "code": "4155000000"
    },
    {
      "name": "김포시",
      "code": "4157000000"
    },
    {
      "name": "화성시",
      "code": "4159000000"
    },
    {
      "name": "광주시",
      "code": "4161000000"
    },
    {
      "name": "양주시",
      "code": "4163000000"
    },
    {
      "name": "포천시",
      "code": "4165000000"
    },
    {
      "name": "여주시",
      "code": "4167000000"
    },
    {
      "name": "양주군",
      "code": "4171000000"
    },
    {
      "name": "남양주군",
      "code": "4172000000"
    },
    {
      "name": "여주군",
      "code": "4173000000"
    },
    {
      "name": "평택군",
      "code": "4174000000"
    },
    {
      "name": "화성군",
      "code": "4175000000"
    },
    {
      "name": "시흥군",
      "code": "4176000000"
    },
    {
      "name": "파주군",
      "code": "4177000000"
    },
    {
      "name": "고양군",
      "code": "4178000000"
    },
    {
      "name": "광주군",
      "code": "4179000000"
    },
    {
      "name": "연천군",
      "code": "4180000000"
    },
    {
      "name": "포천군",
      "code": "4181000000"
    },
    {
      "name": "가평군",
      "code": "4182000000"
    },
    {
      "name": "양평군",
      "code": "4183000000"
    },
    {
      "name": "이천군",
      "code": "4184000000"
    },
    {
      "name": "용인군",
      "code": "4185000000"
    },
    {
      "name": "안성군",
      "code": "4186000000"
    },
    {
      "name": "김포군",
      "code": "4187000000"
    },
    {
      "name": "강화군",
      "code": "4188000000"
    },
    {
      "name": "옹진군",
      "code": "4189000000"
    }
  ],
  "4200000000": [
    {
      "name": "울진군",
      "code": "4205000000"
    },
    {
      "name": "춘천시",
      "code": "4211000000"
    },
    {
      "name": "원주시",
      "code": "4213000000"
    },
    {
      "name": "강릉시",
      "code": "4215000000"
    },
    {
      "name": "동해시",
      "code": "4217000000"
    },
    {
      "name": "태백시",
      "code": "4219000000"
    },
    {
      "name": "속초시",
      "code": "4221000000"
    },
    {
      "name": "삼척시",
      "code": "4223000000"
    },
    {
      "name": "춘성군",
      "code": "4271000000"
    },
    {
      "name": "춘천군",
      "code": "4271500000"
    },
    {
      "name": "홍천군",
      "code": "4272000000"
    },
    {
      "name": "횡성군",
      "code": "4273000000"
    },
    {
      "name": "원성군",
      "code": "4274000000"
    },
    {
      "name": "원주군",
      "code": "4274500000"
    },
    {
      "name": "영월군",
      "code": "4275000000"
    },
    {
      "name": "평창군",
      "code": "4276000000"
    },
    {
      "name": "정선군",
      "code": "4277000000"
    },
    {
      "name": "철원군",
      "code": "4278000000"
    },
    {
      "name": "화천군",
      "code": "4279000000"
    },
    {
      "name": "양구군",
      "code": "4280000000"
    },
    {
      "name": "인제군",
      "code": "4281000000"
    },
    {
      "name": "고성군",
      "code": "4282000000"
    },
    {
      "name": "양양군",
      "code": "4283000000"
    },
    {
      "name": "명주군",
      "code": "4284000000"
    },
    {
      "name": "삼척군",
      "code": "4285000000"
    }
  ],
  "4300000000": [
    {
      "name": "제천군",
      "code": "4305000000"
    },
    {
      "name": "청주시",
      "code": "4311000000"
    },
    {
      "name": "청주시상당구",
      "code": "4311100000"
    },
    {
      "name": "청주시서원구",
      "code": "4311200000"
    },
    {
      "name": "청주시흥덕구",
      "code": "4311300000"
    },
    {
      "name": "청주시청원구",
      "code": "4311400000"
    },
    {
      "name": "청주시동부출",
      "code": "4311500000"
    },
    {
      "name": "청주시서부출",
      "code": "4311600000"
    },
    {
      "name": "충주시",
      "code": "4313000000"
    },
    {
      "name": "제천시",
      "code": "4315000000"
    },
    {
      "name": "청원군",
      "code": "4371000000"
    },
    {
      "name": "보은군",
      "code": "4372000000"
    },
    {
      "name": "옥천군",
      "code": "4373000000"
    },
    {
      "name": "영동군",
      "code": "4374000000"
    },
    {
      "name": "증평군",
      "code": "4374500000"
    },
    {
      "name": "진천군",
      "code": "4375000000"
    },
    {
      "name": "괴산군",
      "code": "4376000000"
    },
    {
      "name": "음성군",
      "code": "4377000000"
    },
    {
      "name": "중원군",
      "code": "4378000000"
    },
    {
      "name": "제원군",
      "code": "4379000000"
    },
    {
      "name": "제천군",
      "code": "4379500000"
    },
    {
      "name": "단양군",
      "code": "4380000000"
    },
    {
      "name": "증평출장소",
      "code": "4395000000"
    }
  ],
  "4400000000": [
    {
      "name": "천안군",
      "code": "4405000000"
    },
    {
      "name": "대전시",
      "code": "4411000000"
    },
    {
      "name": "대전시동구",
      "code": "4411100000"
    },
    {
      "name": "대전시중구",
      "code": "4411300000"
    },
    {
      "name": "대전시서구",
      "code": "4411500000"
    },
    {
      "name": "천안시",
      "code": "4413000000"
    },
    {
      "name": "천안시동남구",
      "code": "4413100000"
    },
    {
      "name": "천안시서북구",
      "code": "4413300000"
    },
    {
      "name": "공주시",
      "code": "4415000000"
    },
    {
      "name": "대천시",
      "code": "4417000000"
    },
    {
      "name": "보령시",
      "code": "4418000000"
    },
    {
      "name": "온양시",
      "code": "4419000000"
    },
    {
      "name": "아산시",
      "code": "4420000000"
    },
    {
      "name": "서산시",
      "code": "4421000000"
    },
    {
      "name": "논산시",
      "code": "4423000000"
    },
    {
      "name": "계룡시",
      "code": "4425000000"
    },
    {
      "name": "당진시",
      "code": "4427000000"
    },
    {
      "name": "금산군",
      "code": "4471000000"
    },
    {
      "name": "대덕군",
      "code": "4472000000"
    },
    {
      "name": "연기군",
      "code": "4473000000"
    },
    {
      "name": "공주군",
      "code": "4474000000"
    },
    {
      "name": "논산군",
      "code": "4475000000"
    },
    {
      "name": "부여군",
      "code": "4476000000"
    },
    {
      "name": "서천군",
      "code": "4477000000"
    },
    {
      "name": "보령군",
      "code": "4478000000"
    },
    {
      "name": "청양군",
      "code": "4479000000"
    },
    {
      "name": "홍성군",
      "code": "4480000000"
    },
    {
      "name": "예산군",
      "code": "4481000000"
    },
    {
      "name": "서산군",
      "code": "4482000000"
    },
    {
      "name": "태안군",
      "code": "4482500000"
    },
    {
      "name": "당진군",
      "code": "4483000000"
    },
    {
      "name": "아산군",
      "code": "4484000000"
    },
    {
      "name": "천원군",
      "code": "4485000000"
    },
    {
      "name": "천안군",
      "code": "4486000000"
    }
  ],
  "4500000000": [
    {
      "name": "금산군",
      "code": "4505000000"
    },
    {
      "name": "전주시",
      "code": "4511000000"
    },
    {
      "name": "전주시완산구",
      "code": "4511100000"
    },
    {
      "name": "전주시덕진구",
      "code": "4511300000"
    },
    {
      "name": "전주시효자출",
      "code": "4511800000"
    },
    {
      "name": "군산시",
      "code": "4513000000"
    },
    {
      "name": "익산시",
      "code": "4514000000"
    },
    {
      "name": "익산시함열출",
      "code": "4514500000"
    },
    {
      "name": "이리시",
      "code": "4515000000"
    },
    {
      "name": "정주시",
      "code": "4517000000"
    },
    {
      "name": "정읍시",
      "code": "4518000000"
    },
    {
      "name": "남원시",
      "code": "4519000000"
    },
    {
      "name": "김제시",
      "code": "4521000000"
    },
    {
      "name": "완주군",
      "code": "4571000000"
    },
    {
      "name": "진안군",
      "code": "4572000000"
    },
    {
      "name": "무주군",
      "code": "4573000000"
    },
    {
      "name": "장수군",
      "code": "4574000000"
    },
    {
      "name": "임실군",
      "code": "4575000000"
    },
    {
      "name": "남원군",
      "code": "4576000000"
    },
    {
      "name": "순창군",
      "code": "4577000000"
    },
    {
      "name": "정읍군",
      "code": "4578000000"
    },
    {
      "name": "고창군",
      "code": "4579000000"
    },
    {
      "name": "부안군",
      "code": "4580000000"
    },
    {
      "name": "김제군",
      "code": "4581000000"
    },
    {
      "name": "옥구군",
      "code": "4582000000"
    },
    {
      "name": "익산군",
      "code": "4583000000"
    }
  ],
  "4600000000": [
    {
      "name": "광주시",
      "code": "4601000000"
    },
    {
      "name": "광주시동구",
      "code": "4601100000"
    },
    {
      "name": "광주시서구",
      "code": "4601200000"
    },
    {
      "name": "광주시북구",
      "code": "4601300000"
    },
    {
      "name": "금성시",
      "code": "4602000000"
    },
    {
      "name": "송정시",
      "code": "4603000000"
    },
    {
      "name": "광산군",
      "code": "4605000000"
    },
    {
      "name": "목포시",
      "code": "4611000000"
    },
    {
      "name": "여수시",
      "code": "4613000000"
    },
    {
      "name": "순천시",
      "code": "4615000000"
    },
    {
      "name": "나주시",
      "code": "4617000000"
    },
    {
      "name": "여천시",
      "code": "4619000000"
    },
    {
      "name": "동광양시",
      "code": "4621000000"
    },
    {
      "name": "광양시",
      "code": "4623000000"
    },
    {
      "name": "담양군",
      "code": "4671000000"
    },
    {
      "name": "곡성군",
      "code": "4672000000"
    },
    {
      "name": "구례군",
      "code": "4673000000"
    },
    {
      "name": "광양군",
      "code": "4674000000"
    },
    {
      "name": "여천군",
      "code": "4675000000"
    },
    {
      "name": "승주군",
      "code": "4676000000"
    },
    {
      "name": "고흥군",
      "code": "4677000000"
    },
    {
      "name": "보성군",
      "code": "4678000000"
    },
    {
      "name": "화순군",
      "code": "4679000000"
    },
    {
      "name": "장흥군",
      "code": "4680000000"
    },
    {
      "name": "강진군",
      "code": "4681000000"
    },
    {
      "name": "해남군",
      "code": "4682000000"
    },
    {
      "name": "영암군",
      "code": "4683000000"
    },
    {
      "name": "무안군",
      "code": "4684000000"
    },
    {
      "name": "나주군",
      "code": "4685000000"
    },
    {
      "name": "함평군",
      "code": "4686000000"
    },
    {
      "name": "영광군",
      "code": "4687000000"
    },
    {
      "name": "장성군",
      "code": "4688000000"
    },
    {
      "name": "완도군",
      "code": "4689000000"
    },
    {
      "name": "진도군",
      "code": "4690000000"
    },
    {
      "name": "신안군",
      "code": "4691000000"
    }
  ],
  "4700000000": [
    {
      "name": "대구시",
      "code": "4701000000"
    },
    {
      "name": "대구시중구",
      "code": "4701100000"
    },
    {
      "name": "대구시동구",
      "code": "4701200000"
    },
    {
      "name": "대구시서구",
      "code": "4701300000"
    },
    {
      "name": "대구시남구",
      "code": "4701400000"
    },
    {
      "name": "대구시북구",
      "code": "4701500000"
    },
    {
      "name": "대구시수성구",
      "code": "4701600000"
    },
    {
      "name": "신안동시",
      "code": "4702000000"
    },
    {
      "name": "영주군",
      "code": "4705000000"
    },
    {
      "name": "포항시",
      "code": "4711000000"
    },
    {
      "name": "포항시남구",
      "code": "4711100000"
    },
    {
      "name": "포항시북구",
      "code": "4711300000"
    },
    {
      "name": "경주시",
      "code": "4713000000"
    },
    {
      "name": "김천시",
      "code": "4715000000"
    },
    {
      "name": "안동시",
      "code": "4717000000"
    },
    {
      "name": "구미시",
      "code": "4719000000"
    },
    {
      "name": "영주시",
      "code": "4721000000"
    },
    {
      "name": "영천시",
      "code": "4723000000"
    },
    {
      "name": "상주시",
      "code": "4725000000"
    },
    {
      "name": "점촌시",
      "code": "4727000000"
    },
    {
      "name": "문경시",
      "code": "4728000000"
    },
    {
      "name": "경산시",
      "code": "4729000000"
    },
    {
      "name": "달성군",
      "code": "4771000000"
    },
    {
      "name": "군위군",
      "code": "4772000000"
    },
    {
      "name": "의성군",
      "code": "4773000000"
    },
    {
      "name": "안동군",
      "code": "4774000000"
    },
    {
      "name": "청송군",
      "code": "4775000000"
    },
    {
      "name": "영양군",
      "code": "4776000000"
    },
    {
      "name": "영덕군",
      "code": "4777000000"
    },
    {
      "name": "영일군",
      "code": "4778000000"
    },
    {
      "name": "월성군",
      "code": "4779000000"
    },
    {
      "name": "경주군",
      "code": "4779500000"
    },
    {
      "name": "영천군",
      "code": "4780000000"
    },
    {
      "name": "경산군",
      "code": "4781000000"
    },
    {
      "name": "청도군",
      "code": "4782000000"
    },
    {
      "name": "고령군",
      "code": "4783000000"
    },
    {
      "name": "성주군",
      "code": "4784000000"
    },
    {
      "name": "칠곡군",
      "code": "4785000000"
    },
    {
      "name": "금릉군",
      "code": "4786000000"
    },
    {
      "name": "선산군",
      "code": "4787000000"
    },
    {
      "name": "상주군",
      "code": "4788000000"
    },
    {
      "name": "문경군",
      "code": "4789000000"
    },
    {
      "name": "예천군",
      "code": "4790000000"
    },
    {
      "name": "영풍군",
      "code": "4791000000"
    },
    {
      "name": "봉화군",
      "code": "4792000000"
    },
    {
      "name": "울진군",
      "code": "4793000000"
    },
    {
      "name": "울릉군",
      "code": "4794000000"
    }
  ],
  "4800000000": [
    {
      "name": "부산시",
      "code": "4801000000"
    },
    {
      "name": "부산시중구",
      "code": "4801100000"
    },
    {
      "name": "부산시서구",
      "code": "4801200000"
    },
    {
      "name": "부산시동구",
      "code": "4801300000"
    },
    {
      "name": "부산시영도구",
      "code": "4801400000"
    },
    {
      "name": "부산시부산진",
      "code": "4801500000"
    },
    {
      "name": "부산시동래구",
      "code": "4801600000"
    },
    {
      "name": "창원군",
      "code": "4805000000"
    },
    {
      "name": "울산군",
      "code": "4806000000"
    },
    {
      "name": "동래군",
      "code": "4807000000"
    },
    {
      "name": "창원시",
      "code": "4811000000"
    },
    {
      "name": "창원시",
      "code": "4812000000"
    },
    {
      "name": "창원시의창구",
      "code": "4812100000"
    },
    {
      "name": "창원시성산구",
      "code": "4812300000"
    },
    {
      "name": "창원시마산합포구",
      "code": "4812500000"
    },
    {
      "name": "창원시마산회원구",
      "code": "4812700000"
    },
    {
      "name": "창원시진해구",
      "code": "4812900000"
    },
    {
      "name": "울산시",
      "code": "4813000000"
    },
    {
      "name": "울산시중구",
      "code": "4813100000"
    },
    {
      "name": "울산시남구",
      "code": "4813300000"
    },
    {
      "name": "울산시동구",
      "code": "4813500000"
    },
    {
      "name": "울산시울주구",
      "code": "4813700000"
    },
    {
      "name": "마산시",
      "code": "4815000000"
    },
    {
      "name": "마산시합포구",
      "code": "4815100000"
    },
    {
      "name": "마산시회원구",
      "code": "4815300000"
    },
    {
      "name": "마산시",
      "code": "4816000000"
    },
    {
      "name": "진주시",
      "code": "4817000000"
    },
    {
      "name": "진해시",
      "code": "4819000000"
    },
    {
      "name": "진해시웅천출",
      "code": "4819500000"
    },
    {
      "name": "진해시웅동출",
      "code": "4819600000"
    },
    {
      "name": "충무시",
      "code": "4821000000"
    },
    {
      "name": "통영시",
      "code": "4822000000"
    },
    {
      "name": "삼천포시",
      "code": "4823000000"
    },
    {
      "name": "삼천포남양출",
      "code": "4823500000"
    },
    {
      "name": "사천시",
      "code": "4824000000"
    },
    {
      "name": "사천남양출장",
      "code": "4824500000"
    },
    {
      "name": "김해시",
      "code": "4825000000"
    },
    {
      "name": "밀양시",
      "code": "4827000000"
    },
    {
      "name": "장승포시",
      "code": "4829000000"
    },
    {
      "name": "거제시",
      "code": "4831000000"
    },
    {
      "name": "양산시",
      "code": "4833000000"
    },
    {
      "name": "진양군",
      "code": "4871000000"
    },
    {
      "name": "의령군",
      "code": "4872000000"
    },
    {
      "name": "함안군",
      "code": "4873000000"
    },
    {
      "name": "창녕군",
      "code": "4874000000"
    },
    {
      "name": "밀양군",
      "code": "4875000000"
    },
    {
      "name": "양산군",
      "code": "4876000000"
    },
    {
      "name": "울주군",
      "code": "4877000000"
    },
    {
      "name": "울산군",
      "code": "4877500000"
    },
    {
      "name": "김해군",
      "code": "4878000000"
    },
    {
      "name": "의창군",
      "code": "4879000000"
    },
    {
      "name": "창원군",
      "code": "4879500000"
    },
    {
      "name": "통영군",
      "code": "4880000000"
    },
    {
      "name": "거제군",
      "code": "4881000000"
    },
    {
      "name": "고성군",
      "code": "4882000000"
    },
    {
      "name": "사천군",
      "code": "4883000000"
    },
    {
      "name": "남해군",
      "code": "4884000000"
    },
    {
      "name": "하동군",
      "code": "4885000000"
    },
    {
      "name": "산청군",
      "code": "4886000000"
    },
    {
      "name": "함양군",
      "code": "4887000000"
    },
    {
      "name": "거창군",
      "code": "4888000000"
    },
    {
      "name": "합천군",
      "code": "4889000000"
    }
  ],
  "5000000000": [
    {
      "name": "제주시",
      "code": "5011000000"
    },
    {
      "name": "서귀포시",
      "code": "5013000000"
    }
  ]
};
